// HomeWork
//  Task 1. Напишите программу, которая на вход принимает два числа и выдаёт, 
//  какое число большее, а какое меньшее.
/*
Console.WriteLine("Inpud a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpud a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 <= num2)
{
  Console.WriteLine("Second number is greater " + num2);
}
else
{
  Console.WriteLine("first number is greater " + num1);
}
*/

// Task 2.Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.
/*
Console.WriteLine("Inpud a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpud a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpud a third number: ");
int num3 = Convert.ToInt32(Console.ReadLine());

int max = num1;
if (num1 > max) max = num1;
if (num2 > max) max = num2;
if (num3 > max) max = num3;
Console.WriteLine("Maximum number: "+max);
*/